In [1]:
import pandas as pd

In [4]:
my_series = pd.Series([4, 7, -5, 3.9, -1])

In [5]:
my_series

0    4.0
1    7.0
2   -5.0
3    3.9
4   -1.0
dtype: float64

In [6]:
my_series[3]

3.9

In [7]:
my_series[1:2]

1    7.0
dtype: float64

In [8]:
my_series[my_series > 0]

0    4.0
1    7.0
3    3.9
dtype: float64

In [9]:
my_series * 10

0    40.0
1    70.0
2   -50.0
3    39.0
4   -10.0
dtype: float64

In [10]:
my_series / 5

0    0.80
1    1.40
2   -1.00
3    0.78
4   -0.20
dtype: float64

In [13]:
import numpy as np

In [14]:
np.exp(my_series)

0      54.598150
1    1096.633158
2       0.006738
3      49.402449
4       0.367879
dtype: float64

In [15]:
np.sum(my_series)

8.9

In [32]:
df = pd.DataFrame({
    'name': ['Маша', 'Вася', 'Эдуард'],
    'age': [25, 8, 48],
    'job': ['Программист', 'Школьник', 'Big Boss'],
    'salary': [100, 10, 200]
}, index=['some', 'random', 'words'])

In [33]:
df

          name  age          job  salary
some      Маша   25  Программист     100
random    Вася    8     Школьник      10
words   Эдуард   48     Big Boss     200

In [24]:
name = df['name']

In [34]:
name

0      Маша
1      Вася
2    Эдуард
Name: name, dtype: object

In [26]:
df[df['salary']>=100]

     name  age          job  salary
0    Маша   25  Программист     100
2  Эдуард   48     Big Boss     200

In [27]:
df['salary'] *= 10

In [35]:
df

          name  age          job  salary
some      Маша   25  Программист     100
random    Вася    8     Школьник      10
words   Эдуард   48     Big Boss     200

In [36]:
df['salary']/2

some       50.0
random      5.0
words     100.0
Name: salary, dtype: float64

In [37]:
df

          name  age          job  salary
some      Маша   25  Программист     100
random    Вася    8     Школьник      10
words   Эдуард   48     Big Boss     200

In [38]:
df.iloc[1]

name          Вася
age              8
job       Школьник
salary          10
Name: random, dtype: object

In [39]:
df.T

               some    random     words
name           Маша      Вася    Эдуард
age              25         8        48
job     Программист  Школьник  Big Boss
salary          100        10       200